# HasInvalidData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilderResult..::..HasInvalidData Property
TessellatedShapeBuilderResult Class See Also
---
Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasInvalidData { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasInvalidData As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasInvalidData {
	bool get ();
}
```

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace